CSI API ETABS v1

# cLoadCasesResponseSpectrum Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseResponseSpectrum ResponseSpectrum { get; }

    ReadOnly Property ResponseSpectrum As cCaseResponseSpectrum
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseResponseSpectrum

    value = instance.ResponseSpectrum

    property cCaseResponseSpectrum^ ResponseSpectrum {
    	cCaseResponseSpectrum^ get ();
    }

    abstract ResponseSpectrum : cCaseResponseSpectrum with get

#### Property Value

Type: cCaseResponseSpectrum

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com